"""
 format函数
 format(参数1，参数2)
 参数1：需要格式化的数字
 参数2：格式化字符串，用来表示如何格式化
 ps: format(x, "<n.2f)
        x 代表实际格式化的数据，< 表示左对齐， n 表示数据占的长度宽度，.2表示小数点后几位，f 表示实数
        ^ 剧中对齐
"""
x = 123.122223333145
y = format(x, ">40.6f")
z = format(x, "^40.6f")
p = format(x, "0<40.6f")
print(3454656565 ,p)

# 千分制表示法
# 千分号+小数点后保留位数
# format(x,",.2f")
x = 196453.3324
print(format(x,",.2f"))

# 科学计数法
# 科学计数法+小数点保留
# format(x,"e")
print(format(x,"0.4e"))



print(10, 100, 2000, 3000, 20)
print(10, 1000, 20000, 3000, 200)
print(10, 10000, 200000, 30000, 2000)

# 5代表宽度 <代表左对齐（默认右对齐） d代表整数 f代表实数 s代表字符串
print(format(10,"<5d"), 100, 2000, 3000, 20)
print(format(100,"<5d"), 1000, 20000, 3000, 200)
print(format(1000,"<5d"), 10000, 200000, 30000, 2000)

a = 1
b = 9
if a is b:
    print(True)
elif a is not b:
    print(False)
